{
  "backend/main.mo": "Motoko canister implementing access control, user approval, user profiles, and public form submissions using Map-based storage and mixin modules.",
  "feature_evidence.json": "Feature evidence report listing two About Us page enhancements with related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend components, pages, hooks, and styles for reference.",
  "frontend/index.css": "Tailwind CSS configuration defining OKLCH-based color variables for light and dark themes with global styling.",
  "frontend/index.html": "Base HTML entry file loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all routes and wraps the app with RouterProvider and Toaster.",
  "frontend/src/components/CallbackDialog.tsx": "Dialog component containing a callback request form that submits data via useRequestCallback with validation and toast feedback.",
  "frontend/src/components/Footer.tsx": "Footer displaying logo, navigation links, contact details, and office locations using responsive layout.",
  "frontend/src/components/GetQuoteDialog.tsx": "A dialog component that lets users choose an insurance type and opens a prefilled WhatsApp message for quotes.",
  "frontend/src/components/Header.tsx": "Responsive site header with navigation, call button, and Get Quote dialog, including mobile sheet menu.",
  "frontend/src/components/Layout.tsx": "Wraps the app with header and footer and renders routed content via Outlet.",
  "frontend/src/content/officeLocations.ts": "Exports office location data with names and addresses.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useGoogleReviews.ts": "Empty placeholder hook file for Google Reviews.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, loading, login, logout, and state management using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for submitting forms, requesting callbacks, and managing testimonials through the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and insurance-themed color palette.",
  "frontend/src/main.tsx": "Bootstraps the app with React, QueryClientProvider, and InternetIdentityProvider.",
  "frontend/src/pages/AboutUsPage.tsx": "Renders an About Us page with company story, core values, achievements, and mission statement using UI cards and icons.",
  "frontend/src/pages/ClaimAssistancePage.tsx": "Displays claim assistance steps, emergency contact details, and support features with structured cards and alerts.",
  "frontend/src/pages/CompareEducatePage.tsx": "Provides educational insurance comparisons, including term vs endowment details, using cards and accordion sections.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation, submission handling, and contact information cards including phone, email, and locations.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage featuring hero content, reasons to choose the service, insurance categories, and quick action dialogs.",
  "frontend/src/pages/ServicesPage.tsx": "Renders the Services page with a list of insurance services and their details, using cards and icons.",
  "frontend/src/pages/TestimonialsPage.tsx": "Displays approved testimonials with admin delete options and provides a form for submitting new testimonials with ratings and optional video links.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending themes, colors, animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Project state file describing requirements and issues for fixing the About Us founder photo display and adding a short founder bio."
}