{
  "backend/main.mo": "Motoko canister implementing access control, user approvals, profile management, and public form submissions with persistent storage maps and authorization checks.",
  "feature_evidence.json": "Defines feature evidence metadata for updating the founder image, including feature ID, components, and related test IDs.",
  "frontend-file-summaries.txt": "Lists short summaries of all frontend source files, describing each component, page, hook, and style file.",
  "frontend/index.css": "Tailwind CSS base file defining OKLCH color variables for light and dark themes with global styling rules.",
  "frontend/index.html": "Basic HTML entrypoint mounting the React app using Vite and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all site routes and renders the router along with the global toaster.",
  "frontend/src/components/CallbackDialog.tsx": "Dialog component for submitting callback requests with form validation and backend submission via a mutation hook.",
  "frontend/src/components/Footer.tsx": "Footer component showing company info, navigation links, contact details, branch locations, and social icons.",
  "frontend/src/components/GetQuoteDialog.tsx": "Modal component allowing users to select an insurance type and open a WhatsApp quote link.",
  "frontend/src/components/Header.tsx": "Site header with navigation, call button, mobile menu, and integrated GetQuoteDialog trigger.",
  "frontend/src/components/Layout.tsx": "Layout wrapper rendering header, footer, and routed page content.",
  "frontend/src/content/officeLocations.ts": "Exports a list of office locations with names and addresses.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the authenticated or anonymous backend actor and refreshes dependent queries on change.",
  "frontend/src/hooks/useGoogleReviews.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for submitting forms and managing testimonials through the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup with custom theme variables for light and dark modes.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/AboutUsPage.tsx": "Displays the company’s story, mission, values, and achievements using cards, text blocks, and icon sections. Provides a structured About Us layout with hero, story, mission, and values sections.",
  "frontend/src/pages/ClaimAssistancePage.tsx": "Renders a claim assistance guide with step-by-step instructions, emergency helpline alert, and support features. Includes interactive buttons for calling and WhatsApp contact.",
  "frontend/src/pages/CompareEducatePage.tsx": "Presents educational insurance comparisons through cards and accordions, explaining term vs endowment plans and other coverage topics. Focuses on helping users make informed decisions.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation, submission via a mutation hook, and toast feedback, alongside static contact information and office details. Supports calling, WhatsApp, and email links.",
  "frontend/src/pages/HomePage.tsx": "Provides the homepage layout with a hero section, insurance categories, and reasons to choose the service. Includes dialogs for quotes and callbacks and quick-action contact buttons.",
  "frontend/src/pages/ServicesPage.tsx": "Renders a services listing page defining multiple insurance service cards with details like benefits and target audience. Uses UI components and icons to display structured service information.",
  "frontend/src/pages/TestimonialsPage.tsx": "Implements testimonial viewing, submission, and admin deletion with form handling, YouTube URL parsing, and rating UI. Fetches and manages testimonials via custom hooks and displays them in cards.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL and sessionStorage parameters. Includes helpers for persisted URL parameters and hash-based parameter cleanup.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, and theme settings including custom OKLCH-based palettes. Registers typography, container queries, and animate plugins.",
  "project_state.json": "Stores project metadata, feature requests, and state information related to updating the founder photo on the About Us page."
}